import os

CHANNEL_ID = -69215719074444
MAX_BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")
BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")

# --- ССЫЛКИ ---
CHANNEL_URL = "https://max.ru/id3017003164_gos"
SITE_URL = "http://asthandball.ru/"
FORM_URL = "https://pos.gosuslugi.ru/landing/"

# --- ТЕКСТЫ ---
TEXT_SUBSCRIBE = (
    "Для того чтобы продолжить использовать бот, необходимо подписаться на канал\n"
    "ГКУ ДО АО «СШОР им. В.А. Гладченко».\n\n"
    "Для этого нажмите «Открыть канал» или перейдите по ссылке:\n"
    f"{CHANNEL_URL}\n\n"
    "Затем вернитесь в чат-бот и нажмите «Я подписан»."
)

TEXT_WELCOME = (
    "Добро пожаловать в чат-бот ГКУ ДО АО «СШОР им. В.А. Гладченко»!\n\n"
    "Выберите нужную категорию:"
)

TEXT_ABOUT = (
    "Государственное казенное учреждение дополнительного образования Астраханской области «Спортивная школа олимпийского резерва им. В.А. Гладченко» реализует программу спортивной подготовки по гандболу и осуществляет подготовку резерва для формирования детско-юношеских сборных команд, профессиональных спортивных клубов региона и сборных команд Российской Федерации.\n"
    "Спортивную подготовку в учреждении осуществляют высококвалифицированные тренеры-преподаватели, среди которых 6 Заслуженных тренеров России, 4 Отличника народного образования, 5 Отличников физической культуры и спорта России.\n"
)

TEXT_ADDRESSES = (
    "📍 **Адреса учреждения**\n"
    "**Основное здание:**\n"
    "• г. Астрахань, ул. Победы, 55\n"
    "**Другие адреса осуществления тренировочного процесса:**\n" 
    "• г. Астрахань, ул. Н. Островского, 147;\n"
    "• г. Астрахань, ул. М. Луконина, 6 а, литер А;\n"
    "• г. Астрахань, ул. Латышева, стр. 3;\n"
    "• г. Астрахань, ул. Дж. Рида, 43.\n"

TEXT_CONTACTS = (
    "📞 **Контактная информация**\n\n"
    "• Телефон учебно-методической части: +7 (8512) 24-14-94\n"
    "• Email: handball@sshorgladchenko.astrobl.ru\n"
    "• Режим работы: пн.-пт. 08:30-17:30 (директор, учебно-методическая часть)\n"
    "• Тренировочный процесс осуществляется с пн. по вск. согласно утвержденному расписанию работы спортивных групп\n"
)

TEXT_SUPPORT_MENU = (
    "❓ **Часто задаваемые вопросы**\n\n"
    "Выберите направление:"
)

SUPPORT_DATA = {
    "question_1": (
        "✅ **Ответ:**\n\n"
        "Возраст приема:\n"
        "• С 8 лет, бюджетная основа.\n"
    ),
    "question_2": (
        "✅ **Ответ:**\n\n"
        "Программы подготовки:\n"
        "• Дополнительная образовательная программа спортивной подготовки по виду спорта «гандбол»;\n"
        "• Дополнительная общеобразовательная общеразвивающая программа по виду спорта «гандбол».\n"
    ),
    "question_3": (
        "✅ **Ответ:**\n\n"
        "Гандбол;\n"
        "Пляжный гандбол.\n"
    ),
     "question_4": (
        "✅ **Ответ:**\n\n"
        "Мальчики и девочки тренируются раздельно.\n"
    ),
    "question_5": (
        "✅ **Перечень необходимых документов для поступающих:**\n\n"
        "1. Заявление от родителей или законных представителей;\n"
        "2. Фото 3×4 см (3 шт.);\n"
        "3. Копия свидетельства о рождении (или копия паспорта для детей, достигших 14-ти лет);\n"
        "4. Копия СНИЛС;\n"
        "5. Копия страховой медицинского полиса;\n"
        "6. Медицинские документы, подтверждающие отсутствие у поступающего противопоказаний для освоения программы в области физической культуры и спорта;\n"
        "7. Согласие на обработку персональных данных \n"
    ),
}
